testCase3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 1;
        cAlpha          1;
        icAlpha         0;
        alphaOuterCorrectors yes;
        MULESCorr       yes;
        nLimiterIter    10;
        alphaApplyPrevCorr  yes;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        GaussSeidel;
            agglomerator faceAreaPair;
	    mergeLevels 1;
	    nCellsInCoarsestLevel 10;
	    cacheAgglomeration true;
	    tolerance       1e-5;
            relTol          0;
        };
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
	       agglomerator    faceAreaPair;
	               mergeLevels     1;
		               nCellsInCoarsestLevel 10;
			               cacheAgglomeration true;
				       
        tolerance       5e-8;
        relTol          0.001;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|k|omega).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         1;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }






"cellDisplacement.*"
        {
                solver       GAMG;
                smoother     GaussSeidel;
                tolerance    1e-09;
                relTol       0;
        }
        yPsi
        {
                solver       GAMG;
                smoother     GaussSeidel;
                tolerance    1e-09;
                relTol       0.0;
        }
        yPsiFinal
        {
                $yPsi;
        }


        Phi
		        {
				                solver          GAMG;
						                smoother        DIC;
								                tolerance       1e-06;
										                relTol          0.01;
												                                                                    }

}
PIMPLE
{
    momentumPredictor   no;

    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 3;

    maxCo               5;
    maxAlphaCo          1;
     consistent yes;
    rDeltaTSmoothingCoeff 0.05;
    rDeltaTDampingCoeff 0.5;
    nAlphaSpreadIter    0;
    nAlphaSweepIter     0;
    maxDeltaT           0.05;


    residualControl
	        {
			        "(p_rgh|U|k|omega)"
					        {
							            tolerance 1e-4;
								                relTol 0.01;
										        }
				    }

}

potentialFlow
{
	        PhiRefCell 0;
		        PhiRefValue 0;
			        nNonOrthogonalCorrectors 3;
}


relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
